zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_aux_evctl.h
// Field:    [13] AUX_SMPH_AUTOTAKE_DONE
//
// See AUX_SMPH:AUTOTAKE.SMPH_ID for description.
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE                    0x00002000
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE_BITN                       13
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE_M                  0x00002000
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE_S                          13

// Field:    [12] AUX_ADC_FIFO_NOT_EMPTY
//
// AUX_ANAIF:ADCFIFOSTAT.EMPTY negated
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY                    0x00001000
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_BITN                       12
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_M                  0x00001000
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_S                          12

// Field:    [11] AUX_ADC_FIFO_ALMOST_FULL
//
// AUX_ANAIF:ADCFIFOSTAT.ALMOST_FULL
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL                  0x00000800
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_BITN                     11
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_M                0x00000800
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_S                        11

// Field:    [10] AUX_ADC_IRQ
//
// The logical function for this event is configurable.
//
// When DMACTL.EN = 1 :
//    Event = UDMA0 Channel 7 done event     OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// When DMACTL.EN = 0 :
//    Event = (NOT AUX_ANAIF:ADCFIFOSTAT.EMPTY)      OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// Bit 7 in UDMA0:DONEMASK must be 0.
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ                               0x00000400
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_BITN                                  10
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_M                             0x00000400
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_S                                     10

// Field:     [9] AUX_ADC_DONE
//
// AUX_ANAIF ADC conversion done event.
// Event is synchronized at AUX bus rate.
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE                              0x00000200
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_BITN                                  9
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_M                            0x00000200
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_S                                     9

// Field:     [8] AUX_ISRC_RESET_N
//
// AUX_ANAIF:ISRCCTL.RESET_N
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N                          0x00000100
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_BITN                              8
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_M                        0x00000100
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_S                                 8

// Field:     [7] AUX_TDC_DONE
//
// AUX_TDC:STAT.DONE
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE                              0x00000080
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_BITN                                  7
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_M                            0x00000080
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_S                                     7

// Field:     [6] AUX_TIMER0_EV
//
// AUX_TIMER0_EV event, see AUX_TIMER01:T0TARGET for description.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV                             0x00000040
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_BITN                                 6
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_M                           0x00000040
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_S                                    6

// Field:     [5] AUX_TIMER1_EV
//
// AUX_TIMER1_EV event, see AUX_TIMER01:T1TARGET for description.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV                             0x00000020
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_BITN                                 5
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_M                           0x00000020
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_S                                    5

// Field:     [4] AUX_TIMER2_PULSE
//
// AUX_TIMER2 pulse event.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE                          0x00000010
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE_BITN                              4
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE_M                        0x00000010
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE_S                                 4

// Field:     [3] AUX_TIMER2_EV3
//
// AUX_TIMER2 event output 3.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3                            0x00000008
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3_BITN                                3
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3_M                          0x00000008
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3_S                                   3

// Field:     [2] AUX_TIMER2_EV2
//
// AUX_TIMER2 event output 2.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2                            0x00000004
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2_BITN                                2
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2_M                          0x00000004
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2_S                                   2

// Field:     [1] AUX_TIMER2_EV1
//
// AUX_TIMER2 event output 1.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1                            0x00000002
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1_BITN                                1
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1_M                          0x00000002
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1_S                                   1

// Field:     [0] AUX_TIMER2_EV0
//
// AUX_TIMER2 event output 0.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV0                            0x00000001
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV0_BITN                                0
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV0_M                          0x00000001
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV0_S                                   0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SCEWEVCFG0
//
//*****************************************************************************
// Field:     [6] COMB_EV_EN
//
// Event combination control:
//
// 0: Disable event combination.
// 1: Enable event combination.
#define AUX_EVCTL_SCEWEVCFG0_COMB_EV_EN                             0x00000040
#define AUX_EVCTL_SCEWEVCFG0_COMB_EV_EN_BITN                                 6
#define AUX_EVCTL_SCEWEVCFG0_COMB_EV_EN_M                           0x00000040
#define AUX_EVCTL_SCEWEVCFG0_COMB_EV_EN_S                                    6

// Field:   [5:0] EV0_SEL
//
// Select the event source from the synchronous event bus to be used in event
// equation.
// ENUMs:
// AUX_TIMER2_CLKSWITCH_RDY EVSTAT3.AUX_TIMER2_CLKSWITCH_RDY
// AUX_DAC_HOLD_ACTIVE      EVSTAT3.AUX_DAC_HOLD_ACTIVE
// AUX_SMPH_AUTOTAKE_DONE   EVSTAT3.AUX_SMPH_AUTOTAKE_DONE
// AUX_ADC_FIFO_NOT_EMPTY   EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY
// AUX_ADC_FIFO_ALMOST_FULL EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_IRQ              EVSTAT3.AUX_ADC_IRQ
// AUX_ADC_DONE             EVSTAT3.AUX_ADC_DONE
// AUX_ISRC_RESET_N         EVSTAT3.AUX_ISRC_RESET_N
// AUX_TDC_DONE             EVSTAT3.AUX_TDC_DONE
// AUX_TIMER0_EV            EVSTAT3.AUX_TIMER0_EV
// AUX_TIMER1_EV            EVSTAT3.AUX_TIMER1_EV
// AUX_TIMER2_PULSE         EVSTAT3.AUX_TIMER2_PULSE
// AUX_TIMER2_EV3           EVSTAT3.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           EVSTAT3.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           EVSTAT3.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           EVSTAT3.AUX_TIMER2_EV0
// AUX_COMPB                EVSTAT2.AUX_COMPB
// AUX_COMPA                EVSTAT2.AUX_COMPA
// MCU_OBSMUX1              EVSTAT2.MCU_OBSMUX1
// MCU_OBSMUX0              EVSTAT2.MCU_OBSMUX0
// MCU_EV                   EVSTAT2.MCU_EV
// ACLK_REF                 EVSTAT2.ACLK_REF
// VDDR_RECHARGE            EVSTAT2.VDDR_RECHARGE
// MCU_ACTIVE               EVSTAT2.MCU_ACTIVE
// PWR_DWN                  EVSTAT2.PWR_DWN
// SCLK_LF                  EVSTAT2.SCLK_LF
// AON_BATMON_TEMP_UPD      EVSTAT2.AON_BATMON_TEMP_UPD
// AON_BATMON_BAT_UPD       EVSTAT2.AON_BATMON_BAT_UPD
// AON_RTC_4KHZ             EVSTAT2.AON_RTC_4KHZ
// AON_RTC_CH2_DLY          EVSTAT2.AON_RTC_CH2_DLY
// AON_RTC_CH2              EVSTAT2.AON_RTC_CH2
// AUX_PROG_DLY_IDLE        Programmable delay event as described in PROGDLY
// AUXIO31                  EVSTAT1.AUXIO31
// AUXIO30                  EVSTAT1.AUXIO30
// AUXIO29                  EVSTAT1.AUXIO29
// AUXIO28                  EVSTAT1.AUXIO28
// AUXIO27                  EVSTAT1.AUXIO27
// AUXIO26                  EVSTAT1.AUXIO26
// AUXIO25                  EVSTAT1.AUXIO25
// AUXIO24                  EVSTAT1.AUXIO24
// AUXIO23                  EVSTAT1.AUXIO23
// AUXIO22                  EVSTAT1.AUXIO22
// AUXIO21                  EVSTAT1.AUXIO21
// AUXIO20                  EVSTAT1.AUXIO20
// AUXIO19                  EVSTAT1.AUXIO19
// AUXIO18                  EVSTAT1.AUXIO18
// AUXIO17                  EVSTAT1.AUXIO17
// AUXIO16                  EVSTAT1.AUXIO16
// AUXIO15                  EVSTAT0.AUXIO15
// AUXIO14                  EVSTAT0.AUXIO14
// AUXIO13                  EVSTAT0.AUXIO13
// AUXIO12                  EVSTAT0.AUXIO12
// AUXIO11                  EVSTAT0.AUXIO11
// AUXIO10                  EVSTAT0.AUXIO10
// AUXIO9                   EVSTAT0.AUXIO9
// AUXIO8                   EVSTAT0.AUXIO8
// AUXIO7                   EVSTAT0.AUXIO7
// AUXIO6                   EVSTAT0.AUXIO6
// AUXIO5                   EVSTAT0.AUXIO5
// AUXIO4                   EVSTAT0.AUXIO4
// AUXIO3                   EVSTAT0.AUXIO3
// AUXIO2                   EVSTAT0.AUXIO2
// AUXIO1                   EVSTAT0.AUXIO1
// AUXIO0                   EVSTAT0.AUXIO0
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_W                                       6
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_M                              0x0000003F
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_S                                       0
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER2_CLKSWITCH_RDY       0x0000003F
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_DAC_HOLD_ACTIVE            0x0000003E
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_SMPH_AUTOTAKE_DONE         0x0000003D
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_ADC_FIFO_NOT_EMPTY         0x0000003C
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_ADC_FIFO_ALMOST_FULL       0x0000003B
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_ADC_IRQ                    0x0000003A
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_ADC_DONE                   0x00000039
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_ISRC_RESET_N               0x00000038
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TDC_DONE                   0x00000037
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER0_EV                  0x00000036
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER1_EV                  0x00000035
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER2_PULSE               0x00000034
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER2_EV3                 0x00000033
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER2_EV2                 0x00000032
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER2_EV1                 0x00000031
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_TIMER2_EV0                 0x00000030
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_COMPB                      0x0000002F
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_COMPA                      0x0000002E
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_MCU_OBSMUX1                    0x0000002D
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_MCU_OBSMUX0                    0x0000002C
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_MCU_EV                         0x0000002B
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_ACLK_REF                       0x0000002A
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_VDDR_RECHARGE                  0x00000029
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_MCU_ACTIVE                     0x00000028
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_PWR_DWN                        0x00000027
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_SCLK_LF                        0x00000026
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AON_BATMON_TEMP_UPD            0x00000025
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AON_BATMON_BAT_UPD             0x00000024
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AON_RTC_4KHZ                   0x00000023
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AON_RTC_CH2_DLY                0x00000022
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AON_RTC_CH2                    0x00000021
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUX_PROG_DLY_IDLE              0x00000020
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO31                        0x0000001F
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO30                        0x0000001E
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO29                        0x0000001D
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO28                        0x0000001C
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO27                        0x0000001B
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO26                        0x0000001A
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO25                        0x00000019
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO24                        0x00000018
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO23                        0x00000017
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO22                        0x00000016
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO21                        0x00000015
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO20                        0x00000014
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO19                        0x00000013
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO18                        0x00000012
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO17                        0x00000011
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO16                        0x00000010
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO15                        0x0000000F
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO14                        0x0000000E
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO13                        0x0000000D
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO12                        0x0000000C
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO11                        0x0000000B
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO10                        0x0000000A
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO9                         0x00000009
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO8                         0x00000008
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO7                         0x00000007
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO6                         0x00000006
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO5                         0x00000005
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO4                         0x00000004
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO3                         0x00000003
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO2                         0x00000002
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO1                         0x00000001
#define AUX_EVCTL_SCEWEVCFG0_EV0_SEL_AUXIO0                         0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SCEWEVCFG1
//
//*****************************************************************************
// Field:     [7] EV0_POL
//
// Polarity of SCEWEVCFG0.EV0_SEL event.
//
// When SCEWEVCFG0.COMB_EV_EN is 0:
//
// 0: Non-inverted.
// 1: Non-inverted.
//
// When SCEWEVCFG0.COMB_EV_EN is 1.
//
// 0: Non-inverted.
// 1: Inverted.
#define AUX_EVCTL_SCEWEVCFG1_EV0_POL                                0x00000080
#define AUX_EVCTL_SCEWEVCFG1_EV0_POL_BITN                                    7
#define AUX_EVCTL_SCEWEVCFG1_EV0_POL_M                              0x00000080
#define AUX_EVCTL_SCEWEVCFG1_EV0_POL_S                                       7

// Field:     [6] EV1_POL
//
// Polarity of EV1_SEL event.
//
// When SCEWEVCFG0.COMB_EV_EN is 0:
//
// 0: Non-inverted.
// 1: Non-inverted.
//
// When SCEWEVCFG0.COMB_EV_EN is 1.
//
// 0: Non-inverted.
// 1: Inverted.
#define AUX_EVCTL_SCEWEVCFG1_EV1_POL                                0x00000040
#define AUX_EVCTL_SCEWEVCFG1_EV1_POL_BITN                                    6
#define AUX_EVCTL_SCEWEVCFG1_EV1_POL_M                              0x00000040
#define AUX_EVCTL_SCEWEVCFG1_EV1_POL_S                                       6

