zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_aux_evctl.h
// Field:    [14] AUX_TIMER2_EV3
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV3.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV3                         0x00004000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV3_BITN                            14
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV3_M                       0x00004000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV3_S                               14
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV3_LOW                     0x00004000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV3_HIGH                    0x00000000

// Field:    [13] AUX_TIMER2_EV2
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV2.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV2                         0x00002000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV2_BITN                            13
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV2_M                       0x00002000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV2_S                               13
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV2_LOW                     0x00002000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV2_HIGH                    0x00000000

// Field:    [12] AUX_TIMER2_EV1
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV1.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV1                         0x00001000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV1_BITN                            12
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV1_M                       0x00001000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV1_S                               12
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV1_LOW                     0x00001000
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV1_HIGH                    0x00000000

// Field:    [11] AUX_TIMER2_EV0
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER2_EV0.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV0                         0x00000800
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV0_BITN                            11
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV0_M                       0x00000800
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV0_S                               11
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV0_LOW                     0x00000800
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER2_EV0_HIGH                    0x00000000

// Field:    [10] AUX_ADC_IRQ
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_ADC_IRQ.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ                            0x00000400
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_BITN                               10
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_M                          0x00000400
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_S                                  10
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_LOW                        0x00000400
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_IRQ_HIGH                       0x00000000

// Field:     [9] MCU_OBSMUX0
//
// Select the event source level that sets EVTOMCUFLAGS.MCU_OBSMUX0.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0                            0x00000200
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_BITN                                9
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_M                          0x00000200
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_S                                   9
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_LOW                        0x00000200
#define AUX_EVCTL_EVTOMCUPOL_MCU_OBSMUX0_HIGH                       0x00000000

// Field:     [8] AUX_ADC_FIFO_ALMOST_FULL
//
// Select the event source level that sets
// EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL               0x00000100
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_BITN                   8
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_M             0x00000100
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_S                      8
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_LOW           0x00000100
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_FIFO_ALMOST_FULL_HIGH          0x00000000

// Field:     [7] AUX_ADC_DONE
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_ADC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE                           0x00000080
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_BITN                               7
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_M                         0x00000080
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_S                                  7
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_LOW                       0x00000080
#define AUX_EVCTL_EVTOMCUPOL_AUX_ADC_DONE_HIGH                      0x00000000

// Field:     [6] AUX_SMPH_AUTOTAKE_DONE
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_SMPH_AUTOTAKE_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE                 0x00000040
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_BITN                     6
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_M               0x00000040
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_S                        6
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_LOW             0x00000040
#define AUX_EVCTL_EVTOMCUPOL_AUX_SMPH_AUTOTAKE_DONE_HIGH            0x00000000

