zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_aux_evctl.h
// Field:    [10] AUX_ADC_IRQ
//
// Write 1 to clear EVTOMCUFLAGS.AUX_ADC_IRQ.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ                       0x00000400
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ_BITN                          10
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ_M                     0x00000400
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_IRQ_S                             10

// Field:     [9] MCU_OBSMUX0
//
// Write 1 to clear EVTOMCUFLAGS.MCU_OBSMUX0.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_MCU_OBSMUX0                       0x00000200
#define AUX_EVCTL_EVTOMCUFLAGSCLR_MCU_OBSMUX0_BITN                           9
#define AUX_EVCTL_EVTOMCUFLAGSCLR_MCU_OBSMUX0_M                     0x00000200
#define AUX_EVCTL_EVTOMCUFLAGSCLR_MCU_OBSMUX0_S                              9

// Field:     [8] AUX_ADC_FIFO_ALMOST_FULL
//
// Write 1 to clear EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_FIFO_ALMOST_FULL          0x00000100
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_FIFO_ALMOST_FULL_BITN              8
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_FIFO_ALMOST_FULL_M        0x00000100
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_FIFO_ALMOST_FULL_S                 8

// Field:     [7] AUX_ADC_DONE
//
// Write 1 to clear EVTOMCUFLAGS.AUX_ADC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_DONE                      0x00000080
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_DONE_BITN                          7
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_DONE_M                    0x00000080
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_ADC_DONE_S                             7

// Field:     [6] AUX_SMPH_AUTOTAKE_DONE
//
// Write 1 to clear EVTOMCUFLAGS.AUX_SMPH_AUTOTAKE_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_SMPH_AUTOTAKE_DONE            0x00000040
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_SMPH_AUTOTAKE_DONE_BITN                6
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_SMPH_AUTOTAKE_DONE_M          0x00000040
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_SMPH_AUTOTAKE_DONE_S                   6

// Field:     [5] AUX_TIMER1_EV
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TIMER1_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER1_EV                     0x00000020
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER1_EV_BITN                         5
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER1_EV_M                   0x00000020
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER1_EV_S                            5

// Field:     [4] AUX_TIMER0_EV
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TIMER0_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER0_EV                     0x00000010
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER0_EV_BITN                         4
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER0_EV_M                   0x00000010
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER0_EV_S                            4

// Field:     [3] AUX_TDC_DONE
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TDC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TDC_DONE                      0x00000008
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TDC_DONE_BITN                          3
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TDC_DONE_M                    0x00000008
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TDC_DONE_S                             3

// Field:     [2] AUX_COMPB
//
// Write 1 to clear EVTOMCUFLAGS.AUX_COMPB.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB                         0x00000004
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB_BITN                             2
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB_M                       0x00000004
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB_S                                2

// Field:     [1] AUX_COMPA
//
// Write 1 to clear EVTOMCUFLAGS.AUX_COMPA.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA                         0x00000002
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA_BITN                             1
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA_M                       0x00000002
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA_S                                1

// Field:     [0] AUX_WU_EV
//
// Write 1 to clear EVTOMCUFLAGS.AUX_WU_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_WU_EV                         0x00000001
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_WU_EV_BITN                             0
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_WU_EV_M                       0x00000001
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_WU_EV_S                                0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_COMBEVTOMCUMASK
//
//*****************************************************************************
// Field:    [15] AUX_TIMER2_PULSE
//
// EVTOMCUFLAGS.AUX_TIMER2_PULSE contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_PULSE                  0x00008000
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_PULSE_BITN                     15
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_PULSE_M                0x00008000
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_PULSE_S                        15

// Field:    [14] AUX_TIMER2_EV3
//
// EVTOMCUFLAGS.AUX_TIMER2_EV3 contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV3                    0x00004000
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV3_BITN                       14
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV3_M                  0x00004000
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV3_S                          14

// Field:    [13] AUX_TIMER2_EV2
//
// EVTOMCUFLAGS.AUX_TIMER2_EV2 contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV2                    0x00002000
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV2_BITN                       13
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV2_M                  0x00002000
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_TIMER2_EV2_S                          13

